** Org-babel
   Org-babel is a way to include code in an org document and have it properly execute. 
   There is, of course, an Emacs manual : ~C-h i~ Search for org mode and in the org mode manual look for the "[[info:org#Library of Babel][Library of Babel]]".  A pretty extensive tutorial can be found [[https://github.com/erikriverson/org-mode-R-tutorial/blob/master/org-mode-R-tutorial.org][here]]. A more recent workshop gives examples [[http://www.howardism.org/Technical/Emacs/literate-programming-tutorial.html][here]].

   We will want some basic text in our =init.el= file to make things work.
   #+begin_src elisp :eval never
   (setq org-confirm-babel-evaluate nil)
   (setq org-babel-python-command "python3")
     (org-babel-do-load-languages
     'org-babel-load-languages
     '((emacs-lisp . t) 
     (R . t)
     (python . t)))
   #+end_src

   Then you can create a source code block with
   #+Begin_src <langname> :exports code
   <code here ... code here>
   #+End_src 

   There are many optional arguments that can appear on the line with "Begin" that will affect how the output appears and how it gets updated. Many of these *header* arguments are different for different languages and are presented [[https://org-babel.readthedocs.io/en/latest/header-args/][here]]. 


   Here is a functioning babel block for R
   #+Begin_src R :exports both
   a = 2
   b = c(1,2)
   a + b
   #+End_src

   #+RESULTS:
   | 3 |
   | 4 |

   And another for python

   #+Begin_src python :results output :exports both
   myname = "britt"
   mylistname = list(myname)
   for i,j in enumerate(mylistname):
       print((i,j))
   #+End_src

   #+RESULTS:


*** Constants and Variables
    A conceptual difference more than a implementation difference in python. Do you think the value will always be the same, like hours in the day, then it is a "constant". Do you think that the value will mutate over the course your program runs, like the time on a clock, then it is a variable. Both may be defined in python with an equal sign. Some people use the typography to distinguish the two, but note that some programming languages are case sensitive meaning ~ONE~ is different from ~one~. 
    #+begin_src python :exports both :results function replace :session *P363*
      NUMDAYPERYEAR = 365

      x = NUMDAYPERYEAR

      daysThisYear = x + 1
    #+end_src

    #+RESULTS:
    : 366
    
    Here we treat the number of days in a regular year as a constant while allowing ~daysThisYear~ to be a variable which can change with a leap year. 
***** Indexing
      You can get the location of an element in a list by referring to its /index/. Think of the row or column number in a spread sheet program, but indexes can be more powerful, and can be nested easily. In many programming languages, but sadly not all, indexes start at 0. Different programming languages will have slightly different syntax. 
      #+Name: Indexing
      #+begin_src python :session *P363* :exports both :results output
	nameDict = {'firstName' : 'Britt', 'lastName' : 'Anderson'}
	mylist = list(range(1,10))

	print(nameDict['firstName'])

	print(mylist)

	print(mylist[0])

	print(mylist[-1])

	print(mylist[0:4])
      #+end_src

      #+RESULTS: Indexing
      : Britt
      : [1, 2, 3, 4, 5, 6, 7, 8, 9]
      : 1
      : 9
      : [1, 2, 3, 4]

      The use of the =-1= as an index is a python trick for getting the last element in a list. Think of the list as a circle. If you count backwards from a list you will get to the beginning eventually (index 0) if you went back one more step (-1) you would circle back to the end of the list. Test what happens when you try -2. Does it keep going? A lot of learning how to program is exploring. 
     
      #+Name: For Loop
      #+begin_src python :session *P363* :exports both :results output
	for ml in mylist:
            print(ml)


	for i,ml in enumerate(mylist):
            print("The {0}th element was {1}".format(i,ml))
      #+end_src

      #+RESULTS: For Loop
      #+begin_example
      1
      2
      3
      4
      5
      6
      7
      8
      9
      The 0th element was 1
      The 1th element was 2
      The 2th element was 3
      The 3th element was 4
      The 4th element was 5
      The 5th element was 6
      The 6th element was 7
      The 7th element was 8
      The 8th element was 9
      #+end_example
**** Conditionals
     This is where you test whether something is or is not ~True~. Note that Python, but not all computer languages, treats 0 as the same as False, and all non-zero values as True. 

     #+begin_src python :exports code  :session *P363* :results output
       if (2 == 3):
           print("Wha.....?\n\n")
       elif (3 == 2):
           print("Now that is odd")
       else:
           print("2 does not equal 3.")
     #+end_src

     #+RESULTS:
     : 2 does not equal 3.

     NB: note the use of colon (:) at the end of the =for= and =while= lines. 

     #+begin_src python :exports both :session *P363* :results output
       i = 0
       while (i<=10):
           print("brittAnderson"[i])
           i = i+1
         #+end_src

         #+RESULTS:
         #+begin_example
         b
         r
         i
         t
         t
         A
         n
         d
         e
         r
         s
         #+end_example

*** Functions
    We encountered an earlier example of this in the [[file:rStudioWinMacFirstSteps.org::*Functions][Rmd lesson]]. Think
    of a function as a machine that grinds meat. You pour in a cow.
    You get out hamburger. Input -> Output. Note that arguments are
    "local". They are not referring to variables outside the function,
    in the program globally, but only make sense locally in the
    function. You drop values into those slots, and then you can use
    those names in your function, because until you use it, your
    function doesn't know what it will be getting.
 #+begin_src python :exports code  :session *P363*
 def myadd(x,y):
    return(x+y)
 #+end_src

 #+RESULTS:

 #+begin_src python :exports both :results output :session *P363*
 myadd(2,3)
 #+end_src

 #+RESULTS:
 : 5

